In [1]:
import pandas as pd

In [2]:
# pandas의 DataFrame 생성
names = ['Bob', 'Jessica', 'Mary', 'John', 'Mel']
births = [968, 156, 77, 578, 973]
customs = [1,5,25,13,23232]

In [3]:
babyDataSet = list(zip(names,births))
df = pd.DataFrame(data = babyDataSet, columns=['Names', 'Births'])

In [8]:
for aa in zip(names,births):
    print(aa)
# zip을 사용하면 여러개의 리스트를 합쳐준다

('Bob', 968)
('Jessica', 156)
('Mary', 77)
('John', 578)
('Mel', 973)

In [9]:
babyDataSet

[('Bob', 968), ('Jessica', 156), ('Mary', 77), ('John', 578), ('Mel', 973)]

In [4]:
df.head()

     Names  Births
0      Bob     968
1  Jessica     156
2     Mary      77
3     John     578
4      Mel     973

In [5]:
# 데이터프레임의 열 타입 정보 출력
df.dtypes

Names     object
Births     int64
dtype: object

In [6]:
# 데이터프레임의 형태 정보
df.index

RangeIndex(start=0, stop=5, step=1)

In [7]:
# 데이터프레임의 열 정보
df.columns

Index(['Names', 'Births'], dtype='object')

In [10]:
# 데이터프레임에서 열 하나만 출력
df['Names']

0        Bob
1    Jessica
2       Mary
3       John
4        Mel
Name: Names, dtype: object

In [11]:
# 0-3 번쨰 인덱스 선택
df[0:3]

     Names  Births
0      Bob     968
1  Jessica     156
2     Mary      77

In [13]:
df

     Names  Births
0      Bob     968
1  Jessica     156
2     Mary      77
3     John     578
4      Mel     973

In [12]:
# Births 열이 100보다 큰 데이터 선택
df[df['Births'] > 100].head()  # 괄호 안에 수를 입력해 원하는 개수만큼 데이터를 볼 수 있다.

     Names  Births
0      Bob     968
1  Jessica     156
3     John     578
4      Mel     973

In [14]:
# 데이터프레임에서 평균값 계산하기
df.mean()

C:\Users\helen\AppData\Local\Temp\ipykernel_13352\2165651144.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df.mean()

Births    550.4
dtype: float64

In [15]:
df.describe()

           Births
count    5.000000
mean   550.400000
std    428.194232
min     77.000000
25%    156.000000
50%    578.000000
75%    968.000000
max    973.000000